<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"664813673e8d48394c4ffd37c7b7636e29935cb555848d7e9f9f331a89b35939","plan_job_ref":"Job Run Terraform plan in staging #115 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12508468746","plan_out_hash":"8922639f41bf14946a7401381b41c277e7fa3b6f5bcf9a4ae03bbb66a0e52204","plan_hash":"df9a9294d304d906270b42461b19f0982b9e5821ec039d47354c5347c7c7c67a","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T19:13:51Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
!~      processes                   = [
-           {
-               command                     = "bundle exec rake cf:on_first_instance db:migrate && exec bundle exec rails s -b 0.0.0.0 -p $PORT -e $RAILS_ENV" -> null
-               disk_quota                  = "2048M" -> null
-               health_check_type           = "port" -> null
-               instances                   = 1 -> null
-               log_rate_limit_per_second   = "-1" -> null
-               memory                      = "256M" -> null
-               readiness_health_check_type = "process" -> null
-               type                        = "web" -> null
            },
+           {
+               command                     = "bundle exec rake cf:on_first_instance db:migrate && exec env HTTP_PORT=$PORT ./bin/thrust ./bin/rails server"
+               disk_quota                  = (known after apply)
+               health_check_type           = (known after apply)
+               instances                   = 1
+               log_rate_limit_per_second   = (known after apply)
+               memory                      = "256M"
+               readiness_health_check_type = (known after apply)
+               type                        = "web"
            },
        ]
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "DtHNqYPOe0PNXmKLLTrt1tSH7IpI1YepmzvH1h6ouoQ=" -> "mdntaAL1crxW59b4GwOged0cYDE9zQcV8/cChDtpXq0="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2024-12-26T19:16:01Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "44a7a78b-6569-6389-25c5-955ce2eac0bb"

-       policy {
-           destination_app = "2a7142e1-762e-4efe-b022-f949863d40d5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "e5c98b1e-a500-479a-be08-ce66b8c4cbc8" -> null
        }
-       policy {
-           destination_app = "2a7142e1-762e-4efe-b022-f949863d40d5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "e5c98b1e-a500-479a-be08-ce66b8c4cbc8" -> null
        }
+       policy {
+           destination_app = "2a7142e1-762e-4efe-b022-f949863d40d5"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "2a7142e1-762e-4efe-b022-f949863d40d5"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #115](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12508468746)